Markdown?

In [ ]:
hello=1+1
print(hello)

print(1+1)

print(hello+1)

hello=4
print(hello+1)

In [1]:
import numpy as np
import pandas as pd

df = pd.read_csv('chicago.csv')
df.head()

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year
0,1423854,2017-06-23 15:09:32,2017-06-23 15:14:53,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0
1,955915,2017-05-25 18:19:03,2017-05-25 18:45:53,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0
2,9031,2017-01-04 08:27:49,2017-01-04 08:34:45,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0
3,304487,2017-03-06 13:49:38,2017-03-06 13:55:28,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0
4,45207,2017-01-17 14:53:07,2017-01-17 15:02:01,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0

In [9]:
df_fix = df.iloc[:, np.r_[2:4,8:9,0]]

In [10]:
df_fix.head()

              End Time  Trip Duration  Birth Year  Unnamed: 0
0  2017-06-23 15:14:53            321      1992.0     1423854
1  2017-05-25 18:45:53           1610      1992.0      955915
2  2017-01-04 08:34:45            416      1981.0        9031
3  2017-03-06 13:55:28            350      1986.0      304487
4  2017-01-17 15:02:01            534      1975.0       45207

In [13]:
import pathlib

In [17]:
p = Path(__file__)
print(p)

NameError: name 'Path' is not defined